app/controllers/home_controller.rb

  def set_parent_slider_value
    if ParentSlider.first.nil?
      ParentSlider.create(value: params["slider"].to_i)
    else
      parent_slider = ParentSlider.first
      parent_slider.update(value: params["slider"].to_i)
---
SELECT  "parent_sliders".* FROM "parent_sliders"  ORDER BY "parent_sliders"."id" ASC LIMIT 1
UPDATE "parent_sliders" SET "value" = ?, "updated_at" = ? WHERE "parent_sliders"."id" = ?  [["value", 1], ["updated_at", "2016-05-30 11:52:42.413727"], ["id", 2]]

  def set_child_slider_value
    child_slider = ChildSlider.find_by(count: params[:count].to_i)
    if child_slider.nil?
      ChildSlider.create(count: params[:count].to_i, value: params[:value].to_i)
    else
      child_slider.update(value: params[:value].to_i)
---
SELECT  "child_sliders".* FROM "child_sliders" WHERE "child_sliders"."count" = ? LIMIT 1  [["count", 6]]
INSERT INTO "child_sliders" ("count", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["count", 2], ["value", 0], ["created_at", "2016-05-30 11:52:43.776834"], ["updated_at", "2016-05-30 11:52:43.776834"]]
UPDATE "child_sliders" SET "value" = ?, "updated_at" = ? WHERE "child_sliders"."id" = ?  [["value", 2], ["updated_at", "2016-05-30 11:52:58.065563"], ["id", 18]]

  def get_config
    parent_slider = ParentSlider.first
    value = parent_slider.nil? ? 0 : parent_slider.value
    child_slider_values = ChildSlider.all.order(:count).select(:value).map(&:value)
---
SELECT "child_sliders"."value" FROM "child_sliders"  ORDER BY "child_sliders"."count" ASC

  def delete_slider
    child_slider = ChildSlider.find_by(count: params["count"].to_i)
    child_slider.delete if child_slider.present?
---
DELETE FROM "child_sliders" WHERE "child_sliders"."id" = ?  [["id", 24]]